# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


a = int(input("Введите трехзначное число:  "))
a_1 = a // 100
a_2 = a // 10 % 10
a_3 = a % 10
sum = a_1 + a_2 + a_3
print(sum, "(", a_1, "+", a_2, "+", a_3, ")",)
